Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: The server is not responding.
sv: Servern svarar inte.

source: Please check privileges of directory containing database.
sv: Kontrollera privilegierna fÃ¶r katalogen som innehÃ¥ller databasen.

source: Detailsâ¦
sv: Detaljerâ¦

source: Connection for controluser as defined in your configuration failed.
sv: Uppkoppling fÃ¶r kontrollanvÃ¤ndare enligt din konfiguration misslyckades.

source: See %sour documentation%s for more information.
sv: Se %sdokumentationen%s fÃ¶r mer information.

source: You are using the mysql extension which is deprecated in phpMyAdmin. Please consider installing the mysqli extension.
sv: Du anvÃ¤nder tillÃ¤gget mysql vilket avrÃ¥ds frÃ¥n i phpMyAdmin. ÃvervÃ¤g att installera tillÃ¤gget mysqli.

source: No Password
sv: Inget lÃ¶senord

source: Re-type:
sv: Skriv igen:

source: Password Hashing:
sv: Hashning av lÃ¶senord:

source: This method requires using an '<i>SSL connection</i>' or an '<i>unencrypted connection that encrypts the password using RSA</i>'; while connecting to the server.
sv: Denna metod krÃ¤ver en '<i>SSL-anslutning</i>' eller en '<i>okrypterad anslutning som krypterar lÃ¶senordet med hjÃ¤lp av RSA</i>'; vid anslutning till servern.

source: @SERVER@ will become the server name
sv: @Server@ kommer bli servernamnet

source: , @DATABASE@ will become the database name
sv: , @DATABASE@ kommer bli databasnamnet

source: , @TABLE@ will become the table name
sv: , @TABLE@ kommer bli tabellnamnet

source: This value is interpreted using %1$sstrftime%2$s, so you can use time formatting strings. Additionally the following transformations will happen: %3$s. Other text will be kept as is. See the %4$sFAQ%5$s for details.
sv: Detta vÃ¤rde tolkas med %1$sstrftime%2$s, sÃ¥ du kan anvÃ¤nda strÃ¤ngar med tidsformatering. Dessutom kommer fÃ¶ljande omvandlingar att ske: %3$s. Ãvrig text behÃ¥lls som den Ã¤r.Se %4$sFAQ%5$s fÃ¶r detaljer.

source: Rename exported databases/tables/columns
sv: Byt namn pÃ¥ exporterade databaser/tabeller/kolumner

source: Could not load export plugins, please check your installation!
sv: Kunde inte lÃ¤sa in insticksprogram fÃ¶r export. Kontrollera din installation!

source: %1$s from %2$s branch
sv: %1$s frÃ¥n grenen %2$s

source: no branch
sv: ingen gren

source: Git revision:
sv: Git version:

source: committed on %1$s by %2$s
sv: inlagd %1$s av %2$s

source: authored on %1$s by %2$s
sv: skriven den %1$s av %2$s

source: Save edited data
sv: Spara editerade data

source: Restore column order
sv: Ã terstÃ¤ll ordningen pÃ¥ kolumner

source: Filter rows
sv: Filtrera rader

source: Search this table
sv: SÃ¶k i denna tabell

source: Begin
sv: Starta

source: Sort by key
sv: Sortera efter nyckel

source: Partial texts
sv: FÃ¶rkortade texter

source: Full texts
sv: Kompletta texter

source: The row has been deleted.
sv: Raden har raderats.

source: Kill
sv: DÃ¶da

source: May be approximate. See [doc@faq3-11]FAQ 3.11[/doc].
sv: Kan vara ungefÃ¤rligt. Se [doc@faq3-11]FAQ 3.11[/doc].

source: Showing rows %1s - %2s
sv: Visar raderna %1s - %2s

source: %1$d total, %2$d in query
sv: %1$d totalt, %2$d i frÃ¥ga

source: %d total
sv: %d totalt

source: Query took %01.4f seconds.
sv: FrÃ¥gan tog %01.4f sekunder.

source: With selected:
sv: Med markerade:

source: Check all
sv: Markera alla

source: Copy to clipboard
sv: Kopiera till urklipp

source: Query results operations
sv: Operationer fÃ¶r frÃ¥geresultat

source: Display chart
sv: Visa diagram

source: Visualize GIS data
sv: Visualisera GIS-data

source: Link not found!
sv: LÃ¤nken hittades inte!

source: Version information
sv: Versionsinformation

source: Data home directory
sv: Hemkatalog fÃ¶r data

source: The common part of the directory path for all InnoDB data files.
sv: Den gemensamma delen av sÃ¶kvÃ¤gen fÃ¶r alla InnoDB-datafiler.

source: Data files
sv: Datafiler

source: Autoextend increment
sv: Automatisk utÃ¶kningsstorlek

source: The increment size for extending the size of an autoextending tablespace when it becomes full.
sv: TillÃ¶kningsstorleken vid automatisk utÃ¶kning av tabellutrymme nÃ¤r det blir fullt.

source: Buffer pool size
sv: Buffertstorlek

source: The size of the memory buffer InnoDB uses to cache data and indexes of its tables.
sv: Storleken pÃ¥ minnesbufferten som InnoDB anvÃ¤nder fÃ¶r cache av data och index till sina tabeller.

source: Buffer Pool
sv: Buffertutrymme

source: Buffer Pool Usage
sv: BuffertanvÃ¤ndning

source: pages
sv: sidor

source: Free pages
sv: Fria sidor

source: Dirty pages
sv: Orena sidor

source: Pages containing data
sv: Sidor innehÃ¥llande data

source: Pages to be flushed
sv: Sidor att rensa

source: Busy pages
sv: Upptagna sidor

source: Latched pages
sv: LÃ¥sta sidor

source: Buffer Pool Activity
sv: Buffertpool-aktivitet

source: Read requests
sv: LÃ¤sfÃ¶rfrÃ¥gningar

source: Write requests
sv: SkrivfÃ¶rfrÃ¥gningar

source: Read misses
sv: LÃ¤smissar

source: Write waits
sv: SkrivvÃ¤ntanden

source: Read misses in %
sv: LÃ¤smissar i %

source: Write waits in %
sv: SkrivvÃ¤ntanden i %

source: Data pointer size
sv: Storlek fÃ¶r datapekare

source: The default pointer size in bytes, to be used by CREATE TABLE for MyISAM tables when no MAX_ROWS option is specified.
sv: Standardpekarens storlek i bytes, vilken anvÃ¤nds av CREATE TABLE fÃ¶r MyISAM-tabeller nÃ¤r inget MAX_ROWS-alternativ Ã¤r specificerat.

source: Automatic recovery mode
sv: Automatisk Ã¥terstÃ¤llningslÃ¤ge

source: The mode for automatic recovery of crashed MyISAM tables, as set via the --myisam-recover server startup option.
sv: InstÃ¤llningen fÃ¶r automatisk Ã¥terstÃ¤llning av kraschade MyISAM-tabeller, som satts via serverns startparameter --myisam-recover.

source: Maximum size for temporary sort files
sv: Maximal storlek fÃ¶r temporÃ¤ra sorteringsfiler

source: The maximum size of the temporary file MySQL is allowed to use while re-creating a MyISAM index (during REPAIR TABLE, ALTER TABLE, or LOAD DATA INFILE).
sv: Denna maximala storleken fÃ¶r den temporÃ¤ra filen som MySQL Ã¤r tillÃ¥ten att anvÃ¤nda under Ã¥terskapande av MyISAM-index (vid REPAIR TABLE, ALTER TABLE, eller LOAD DATA INFILE).

source: Maximum size for temporary files on index creation
sv: Maximal storlek fÃ¶r temporÃ¤ra filer vid skapande av index

source: If the temporary file used for fast MyISAM index creation would be larger than using the key cache by the amount specified here, prefer the key cache method.
sv: Om den temporÃ¤ra filen som anvÃ¤nds fÃ¶r snabbt skapande av MyISAM-index skulle vara stÃ¶rre Ã¤n att anvÃ¤nda nyckelcachen vars storlek specificeras hÃ¤r, sÃ¥ fÃ¶redras metoden med nyckelcachen.

source: Repair threads
sv: Reparera trÃ¥dar

source: If this value is greater than 1, MyISAM table indexes are created in parallel (each index in its own thread) during the repair by sorting process.
sv: Om detta vÃ¤rde Ã¤r stÃ¶rre Ã¤n 1 skapas MyISAM-tabellindex parallellt (varje index i sin egen trÃ¥d) under reparationen vid sorteringsprocess.

source: Sort buffer size
sv: Storlek fÃ¶r sorteringsbuffert

source: The buffer that is allocated when sorting MyISAM indexes during a REPAIR TABLE or when creating indexes with CREATE INDEX or ALTER TABLE.
sv: Bufferten som allokeras vid sortering av MyISAM-index under REPAIR TABLE eller vid skapande av index med CREATE INDEX eller ALTER TABLE.

source: Index cache size
sv: Cachestorlek fÃ¶r index

source: This is the amount of memory allocated to the index cache. Default value is 32MB. The memory allocated here is used only for caching index pages.
sv: Detta Ã¤r mÃ¤ngden minne som allokeras fÃ¶r indexcachen. StandardvÃ¤rdet Ã¤r 32MB. Minnet som allokeras hÃ¤r anvÃ¤nds endast fÃ¶r cache av indexsidor.

source: Record cache size
sv: Cachestorlek fÃ¶r rad

source: This is the amount of memory allocated to the record cache used to cache table data. The default value is 32MB. This memory is used to cache changes to the handle data (.xtd) and row pointer (.xtr) files.
sv: Detta Ã¤r mÃ¤ngden minne som allokeras fÃ¶r radcachen som anvÃ¤nds fÃ¶r cache av tabelldata. StandardvÃ¤rdet Ã¤r 32MB. Detta minne anvÃ¤nds fÃ¶r att cacha Ã¤ndringar i filer fÃ¶r hanteringsdata (.xtd) och radpekare (.xtr).

source: Log cache size
sv: Cachestorlek fÃ¶r logg

source: The amount of memory allocated to the transaction log cache used to cache on transaction log data. The default is 16MB.
sv: MÃ¤ngden minne som allokeras fÃ¶r transaktionsloggcachen som anvÃ¤nds fÃ¶r cache av transaktionsloggdata. StandardvÃ¤rdet Ã¤r 16MB.

source: Log file threshold
sv: GrÃ¤ns fÃ¶r loggfil

source: The size of a transaction log before rollover, and a new log is created. The default value is 16MB.
sv: Storleken pÃ¥ en transaktionslogg fÃ¶re Ã¶vergÃ¥ng dÃ¥ en ny logg skapas. StandardvÃ¤rdet Ã¤r 16MB.

source: Transaction buffer size
sv: Transactionsbufferstorlek

source: The size of the global transaction log buffer (the engine allocates 2 buffers of this size). The default is 1MB.
sv: Storleken pÃ¥ den globala transaktionsloggbuffern (motorn allokerar 2 buffrar med denna storlek). StandardvÃ¤rdet Ã¤r 1MB.

source: Checkpoint frequency
sv: Frekvens fÃ¶r kontrollpunkt

source: The amount of data written to the transaction log before a checkpoint is performed. The default value is 24MB.
sv: MÃ¤ngden data som skrivs till transaktionsloggen innan en kontrollpunkt utfÃ¶rs. StandardvÃ¤rdet Ã¤r 24MB.

source: Data log threshold
sv: GrÃ¤ns fÃ¶r datalogg

source: The maximum size of a data log file. The default value is 64MB. PBXT can create a maximum of 32000 data logs, which are used by all tables. So the value of this variable can be increased to increase the total amount of data that can be stored in the database.
sv: Maximal storlek fÃ¶r dataloggfil. StandardvÃ¤rdet Ã¤r 64MB. PBXT kan skapa maximalt 32000 dataloggar, som anvÃ¤nds av alla tabeller. SÃ¥ denna variabels vÃ¤rde kan Ã¶kas fÃ¶r att Ã¶ka den totala mÃ¤ngden data som kan lagras i databasen.

source: Garbage threshold
sv: GrÃ¤ns fÃ¶r skrÃ¤p

source: The percentage of garbage in a data log file before it is compacted. This is a value between 1 and 99. The default is 50.
sv: Andelen skrÃ¤p i en dataloggfil innan den komprimeras. Detta Ã¤r ett vÃ¤rde mellan 1 och 99. StandardvÃ¤rdet Ã¤r 50.

source: Log buffer size
sv: Bufferstorlek fÃ¶r logg

source: The size of the buffer used when writing a data log. The default is 256MB. The engine allocates one buffer per thread, but only if the thread is required to write a data log.
sv: Storleken pÃ¥ anvÃ¤nd buffer vid skrivning av datalogg. StandardvÃ¤rdet Ã¤r 256MB. Motorn allokerar en buffer per trÃ¥d, men endast om trÃ¥den behÃ¶ver skriva en datalogg.

source: Data file grow size
sv: VÃ¤xstorlek fÃ¶r datafil

source: The grow size of the handle data (.xtd) files.
sv: Storleken med vilken filer fÃ¶r hanteringsdata (.xtd) vÃ¤xer.

source: Row file grow size
sv: VÃ¤xstorlek fÃ¶r radfil

source: The grow size of the row pointer (.xtr) files.
sv: Storleken med vilken filer fÃ¶r radpekare (.xtr) vÃ¤xer.

source: Log file count
sv: Antal loggfiler

source: This is the number of transaction log files (pbxt/system/xlog*.xt) the system will maintain. If the number of logs exceeds this value then old logs will be deleted, otherwise they are renamed and given the next highest number.
sv: Detta Ã¤r antalet transaktionsloggfiler (pbxt/system/xlog*.xt) som systemet upprÃ¤tthÃ¥ller. Om antalet loggar Ã¶verstiger detta vÃ¤rde tas gamla loggar bort. Annars dÃ¶ps de om och ges det nÃ¤st hÃ¶gsta numret.

source: Documentation and further information about PBXT can be found on the %sPrimeBase XT Home Page%s.
sv: Dokumentation och ytterligare information finns pÃ¥ %sPrimeBase XT Home Page%s.

source: Too many error messages, some are not displayed.
sv: FÃ¶r mÃ¥nga felmeddelanden, en del kommer inte visas.

source: Automatically send report next time
sv: Skicka rapport automatiskt nÃ¤sta gÃ¥ng

source: Insufficient space to save the file %s.
sv: OtillrÃ¤ckligt utrymme fÃ¶r att spara filen %s.

source: File %s already exists on server, change filename or check overwrite option.
sv: Filen %s finns redan pÃ¥ servern, Ã¤ndra filnamnet eller kontrollera ersÃ¤ttningsalternativet.

source: The web server does not have permission to save the file %s.
sv: Webbservern har inte behÃ¶righet att spara filen %s.

source: Dump has been saved to file %s.
sv: Dump har sparats till filen %s.

source: File was not an uploaded file.
sv: Filen var inte en uppladdad fil.

source: The uploaded file exceeds the upload_max_filesize directive in php.ini.
sv: Den uppladdade filen Ã¶verskrider direktivet upload_max_filesize i php.ini.

source: The uploaded file exceeds the MAX_FILE_SIZE directive that was specified in the HTML form.
sv: Den uppladdade filen Ã¶verskrider direktivet MAX_FILE_SIZE som specificerades i HTML-formulÃ¤ret.

source: The uploaded file was only partially uploaded.
sv: Den uppladdade filen blev endast delvis uppladdad.

source: Missing a temporary folder.
sv: Saknar en temporÃ¤r katalog.

source: Failed to write file to disk.
sv: Misslyckades att skriva fil till disk.

source: File upload stopped by extension.
sv: Filuppladdning stoppades av tillÃ¤gg.

source: Unknown error in file upload.
sv: OkÃ¤nt fel i filuppladdning.

source: File is a symbolic link
sv: Filen Ã¤r en symbolisk lÃ¤nk

source: File could not be read!
sv: Filen kunde inte lÃ¤sas!

source: Error moving the uploaded file, see [doc@faq1-11]FAQ 1.11[/doc].
sv: Fel vid flytt av uppladdad fil, se [doc@faq1-11]FAQ 1.11[/doc].

source: Error while moving uploaded file.
sv: Fel vid flytt av uppladdad fil.

source: Cannot read uploaded file.
sv: Kan inte lÃ¤sa uppladdad fil.

source: You attempted to load file with unsupported compression (%s). Either support for it is not implemented or disabled by your configuration.
sv: Du fÃ¶rsÃ¶kte ladda en fil med en komprimering (%s) som inte stÃ¶ds. Antingen Ã¤r detta inte implementerat, eller inaktiverat i din konfiguration.

source: Currently running Git revision %1$s from the %2$s branch.
sv: KÃ¶r nu Git version %1$s fron grenen %2$s.

source: Git information missing!
sv: Git-information saknas!

source: Open new phpMyAdmin window
sv: Ãppna nytt phpMyAdmin-fÃ¶nster

source: Print view
sv: UtskriftsvÃ¤nlig visning

source: Click on the bar to scroll to top of page
sv: Klicka pÃ¥ bommen fÃ¶r att fÃ¶rflytta dig till toppen av sidan

source: Javascript must be enabled past this point!
sv: Javascript mÃ¥ste vara aktiverat efter detta!

source: MySQL returned an empty result set (i.e. zero rows).
sv: MySQL returnerade ett tomt resultat (dvs inga rader).

source: [ROLLBACK occurred.]
sv: [Ã TERTOG tidigare version]

source: The following structures have either been created or altered. Here you can:
sv: FÃ¶ljande strukturer har antingen skapats eller Ã¤ndrats. Du kan:

source: View a structure's contents by clicking on its name.
sv: Visa en strukturs innehÃ¥ll genom att klicka pÃ¥ namnet.

source: Change any of its settings by clicking the corresponding "Options" link.
sv: Ãndra nÃ¥gon av dess instÃ¤llningar genom att klicka pÃ¥ motsvarande "Alternativ"-lÃ¤nk.

source: Edit structure by following the "Structure" link.
sv: Redigera strukturen genom att fÃ¶lja lÃ¤nken "Struktur".

source: Options
sv: Alternativ

source: Go to database: %s
sv: GÃ¥ till databas: %s

source: Edit settings for %s
sv: Redigera instÃ¤llningar fÃ¶r %s

source: Go to table: %s
sv: GÃ¥ till tabell: %s

source: Structure of %s
sv: Struktur fÃ¶r %s

source: Go to view: %s
sv: GÃ¥ till vy: %s

source: Only single-table UPDATE and DELETE queries can be simulated.
sv: Endast entabells-UPDATE och DELETE-kÃ¶rningar simuleras.

source: Only INSERT, UPDATE, DELETE and REPLACE SQL queries containing transactional engine tables can be rolled back.
sv: Enda Infoga, uppdatera, ta bort och ersÃ¤tta SQL-kÃ¶rningar som innehÃ¥ller transaktionella tabeller kan rullas tillbaka.

source: Create an index on &nbsp;%s&nbsp;columns
sv: Skapa ett index fÃ¶r &nbsp;%s&nbsp;kolumn(er)

source: No index defined!
sv: Inga index Ã¤r definierade!

source: Packed
sv: Packad

source: Cardinality
sv: Kardinalitet

source: The primary key has been dropped.
sv: Den primÃ¤ra nyckeln har tagits bort.

source: Index %s has been dropped.
sv: Index %s har tagits bort.

source: The indexes %1$s and %2$s seem to be equal and one of them could possibly be removed.
sv: Index %1$s och %2$s verkar vara identiska och ett av dem kan mÃ¶jligen tas bort.

source: Function
sv: Funktion

source: Binary
sv: BinÃ¤r

source: Because of its length,<br /> this column might not be editable.
sv: PÃ¥ grund av sin lÃ¤ngd,<br /> Ã¤r denna kolumn kanske inte redigerbar.

source: Binary - do not edit
sv: BinÃ¤r - Ã¤ndra inte

source: The directory you set for upload work cannot be reached.
sv: Katalogen du stÃ¤llt in fÃ¶r uppladdning kan inte nÃ¥s.

source: Or
sv: Eller

source: web server upload directory:
sv: Uppladdningskatalog pÃ¥ webbserver:

source: Edit/Insert
sv: Redigera / Infoga

source: and then
sv: och sedan

source: Insert as new row
sv: LÃ¤gg till som ny rad

source: Insert as new row and ignore errors
sv: Infoga som ny rad och ignorera fel

source: Show insert query
sv: Visa insert-frÃ¥ga

source: Go back to previous page
sv: GÃ¥ tillbaka till fÃ¶regÃ¥ende sida

source: Insert another new row
sv: LÃ¤gg till ytterligare en ny rad

source: Go back to this page
sv: GÃ¥ tillbaka till denna sida

source: Edit next row
sv: Ãndra nÃ¤sta rad

source: Use TAB key to move from value to value, or CTRL+arrows to move anywhere.
sv: AnvÃ¤nd TAB-tangenten fÃ¶r att flytta frÃ¥n vÃ¤rde till vÃ¤rde, eller CTRL+pil fÃ¶r att flytta vart som helst.

source: Showing SQL query
sv: Visar SQL-frÃ¥ga

source: Inserted row id: %1$d
sv: Infogade rad-id: %1$d

source: Ignoring unsupported language code.
sv: Ignorera kod frÃ¥n icke-supportrade sprÃ¥k.

source: Linting is disabled for this query because it exceeds the maximum length.
sv: SÃ¶kningen Ã¶verstiger maximal lÃ¤ngd, tillÃ¤gg avstÃ¤ngda.

source: %1$s (near <code>%2$s</code>)
sv: %1$s (nÃ¤ra <code>%2$s</code>)

source: Privileges
sv: Privilegier

source: Operations
sv: Operationer

source: Tracking
sv: SpÃ¥rning

source: Triggers
sv: Trigger

source: Database seems to be empty!
sv: Databasen verkar vara tom!

source: Routines
sv: Rutiner

source: Events
sv: Händelser

source: Central columns
sv: Huvud-kolumner

source: User accounts
sv: AnvÃ¤ndarkonton

source: Binary log
sv: BinÃ¤r logg

source: Replication
sv: Replikering

source: Variables
sv: Variabler

source: Charsets
sv: TeckenuppsÃ¤ttningar

source: Engines
sv: Motorer

source: Plugins
sv: Insticksmoduler

source: Structure only
sv: Enbart struktur

source: Structure and data
sv: Struktur och data

source: Data only
sv: Enbart data

source: Add AUTO INCREMENT value
sv: LÃ¤gg till AUTO INCREMENT-vÃ¤rde

source: Add constraints
sv: LÃ¤gg till restriktioner

source: Adjust privileges
sv: Ãndra privilegier

source: From
sv: Från

source: To
sv: Till

source: Add prefix
sv: LÃ¤gg till prefix

source: Do you really want to execute the following query?
sv: Vill du verkligen exekvera fÃ¶ljande frÃ¥ga?

source: An error has occurred while loading the navigation display
sv: Ett fel uppstod vid inlÃ¤sning av navigeringspanelen

source: Groups:
sv: Grupper:

source: Events:
sv: HÃ¤ndelser:

source: Functions:
sv: Funktioner:

source: Procedures:
sv: Procedurer:

source: Tables:
sv: Tabeller:

source: Views:
sv: Vyer:

source: Show
sv: Visa

source: Empty session data
sv: Tom sessionsdata

source: phpMyAdmin documentation
sv: phpMyAdmin-dokumentation

source: Navigation panel settings
sv: InstÃ¤llningar fÃ¶r navigationspanel

source: Reload navigation panel
sv: Ladda om navigeringspanel

source: There are large item groups in navigation panel which may affect the performance. Consider disabling item grouping in the navigation panel.
sv: Det finns stora artikelgrupper i navigeringspanelen som kan pÃ¥verka prestanda. ÃvervÃ¤ga att inaktivera objektgruppering i navigeringspanelen.

source: Type to filter these, Enter to search all
sv: Skriv fÃ¶r att filtrera, Retur fÃ¶r att sÃ¶ka i alla

source: Clear fast filter
sv: Rensa snabbfilter

source: Collapse all
sv: DÃ¶lj alla

source: Invalid class name "%1$s", using default of "Node"
sv: Ogiltigt klassnamn "%1$s", anvÃ¤nder standard "Node"

source: Expand/Collapse
sv: Expandera/Vik ihop

source: Columns
sv: Kolumn

source: Database operations
sv: Databasoperationer

source: Show hidden items
sv: Visa dolda objekt

source: Functions
sv: Funktioner

source: Procedure
sv: Procedur

source: Procedures
sv: Procedurer

source: Make all columns atomic
sv: GÃ¶ra alla kolumner encelliga

source: First step of normalization (1NF)
sv: FÃ¶rsta steg av normalisering (1NF)

source: Step 1.
sv: Steg 1.

source: Do you have any column which can be split into more than one column? For example: address can be split into street, city, country and zip.
sv: Har du nÃ¥gon kolumn som kan delas upp i mer Ã¤n en kolumn? Till exempel: adress kan delas in i gata, stad, land och postnummer.

source: Show me the central list of columns that are not already in this table
sv: Visa mig kolumner i huvudlistan som inte redan finns i den hÃ¤r tabellen

source: Select oneâ¦
sv: VÃ¤lj enâ¦

source: No such column
sv: Ingen sÃ¥dan kolumn

source: String
sv: StrÃ¤ng

source: split into
sv: delas upp i

source: Have a primary key
sv: Har en primÃ¤r nyckel

source: Primary key already exists.
sv: PrimÃ¤r nyckel finns redan.

source: There is no primary key; please add one.<br/>Hint: A primary key is a column (or combination of columns) that uniquely identify all rows.
sv: Det finns ingen primÃ¤r nyckel; LÃ¤gg till en. <br/> Tips: En primÃ¤r nyckel Ã¤r en kolumn (eller kombination av kolumner) som unikt identifierar alla rader.

source: Add a primary key on existing column(s)
sv: LÃ¤gg till en primÃ¤rnyckel fÃ¶r befintliga kolumner

source: If it's not possible to make existing column combinations as primary key
sv: Om det inte Ã¤r mÃ¶jligt att gÃ¶ra kolumnkombinationer till primÃ¤rnyckel

source: + Add a new primary key column
sv: + LÃ¤gg till en ny primÃ¤r nyckelkolumn

source: Remove redundant columns
sv: ï»¿Ta bort Ã¶verflÃ¶diga kolumner

source: Do you have a group of columns which on combining gives an existing column? For example, if you have first_name, last_name and full_name then combining first_name and last_name gives full_name which is redundant.
sv: Har du en grupp med kolumner som kombinerade ger en befintlig kolumn? Till exempel om du har fÃ¶rnamn/efternamn/full_name, sÃ¥ Ã¤r full_namn Ã¶verflÃ¶digt.

source: Check the columns which are redundant and click on remove. If no redundant column, click on 'No redundant column'
sv: Markera de kolumner som Ã¤r Ã¶verflÃ¶diga och klicka pÃ¥ ta bort. Annars klickar du pÃ¥ "Ingen Ã¶verflÃ¶dig kolumn"

source: Remove selected
sv: Ta bort vald

source: No redundant column
sv: Ingen Ã¶verflÃ¶dig kolumn

source: Move repeating groups
sv: Flytta upprepande grupper

source: Do you have a group of two or more columns that are closely related and are all repeating the same attribute? For example, a table that holds data on books might have columns such as book_id, author1, author2, author3 and so on which form a repeating group. In this case a new table (book_id, author) should be created.
sv: Har du en grupp av tvÃ¥ eller flera kolumner som Ã¤r nÃ¤rbeslÃ¤ktade och alla upprepar samma attribut? Till exempel kan en tabell som innehÃ¥ller data om bÃ¶cker ha kolumner som book_id, author1, FÃ¶rfattare2, author3 och sÃ¥ vidare som bildar en upprepande grupp. I detta fall skapas en ny tabell (book_id, fÃ¶rfattare).

source: Check the columns which form a repeating group. If no such group, click on 'No repeating group'
sv: Markera kolumnerna som utgÃ¶r en upprepande grupp. Om ingen sÃ¥dan grupp, klickar du pÃ¥ "Inget upprepande grupp"
